In [2]:
import pandas as pd

In [53]:
conda install pandas

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [ ]:
# Q.1

In [5]:
series=pd.Series([4,8,15,16,23,42]) #creating a pandas series

In [6]:
series   #printing the series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
# Q.2

In [8]:
var=[1,2,3,4,5,6,7,8,9,10]  #creating a list named var

In [9]:
pd.Series(var)              #printing var as series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
# Q.3 creating a dataframe named data

In [43]:
data={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

In [44]:
pd.DataFrame(data) #printing dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
"""Q.4 A data frame in pandas is a two-dimensional data structure that can   store data of different types (such as integer, string, float, etc.) in rows and columns. A data frame has a tabular format with labeled axes (rows and columns). A data frame can be created from various sources, such as lists, dictionaries, arrays, or files. A data frame is similar to a spreadsheet or a SQL table.

A pandas series is a one-dimensional data structure that can store data of any type (such as integer, string, float, etc.). A series has an index that labels each element in the series. A series can be created from various sources, such as lists, dictionaries, arrays, or scalars. A series is similar to a single column in a data frame or a one-dimensional array.

The main difference between a data frame and a series is that a data frame is a two-dimensional structure with multiple columns, while a series is a one-dimensional structure with a single column. A data frame can be seen as a collection of series that share the same index. A series can be extracted from a data frame by selecting a column or a row.

In [48]:
# This is an example of series
names=["mahi","sam","john","aadi","dishu"]

In [133]:
s=pd.Series(names)

In [134]:
s

0     mahi
1      sam
2     john
3     aadi
4    dishu
dtype: object

In [135]:
type(s)

pandas.core.series.Series

In [ ]:
# This is an example of dataframe

In [136]:
data_1={'name':names}

In [137]:
d=pd.DataFrame(data_1)

In [138]:
d

    name
0   mahi
1    sam
2   john
3   aadi
4  dishu

In [131]:
type(d)

pandas.core.frame.DataFrame

In [ ]:
""" Q.5 Some common functions we can use to manipulate data in a pandas data frame are:

1. df.sort_values (by, ascending, inplace): This function sorts the data frame by one or more columns in ascending or descending order.

2. df.drop (labels, axis, inplace): This function drops the specified rows or columns from the data frame.

3. df.groupby (by): This function groups the data frame by one or more columns and returns a groupby object that can be used for further operations.

4. df.rename (columns, index, inplace): This function renames the columns or index labels of the data frame.

5. df.merge (right, how, on): This function merges two data frames based on a common column or index.

There are more examples of the functions that pandas provides for manipulating data frames.

In [55]:
data={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

In [57]:
df=pd.DataFrame(data)

In [58]:
df.set_index("Age") #set_index() is used to set index.

       Name  Gender
Age
25    Alice  Female
30      Bob    Male
27   Claire  Female

In [ ]:
""" Q.6 Series is a one-dimensional array like structure with homogeneous    data. Series is value mutable but not size mutable.
 
     DataFrame is a two-dimensional array with heterogeneous data. DataFrame is value mutable as well as size mutable.
      
     Panel is a three-dimensional data structure with heterogeneous data. 
Panel is value mutable as well as size mutable.

In [113]:
# Q.7

In [120]:
s1=pd.Series([1,2,3,4,5])  #creating multiple series
s2=pd.Series([6,7,8,9,10])
s3=pd.Series([1,6,9,2,5])
s4=pd.Series([7,9,3,4,2])

In [124]:
df={"key1":s1,"key2":s2,"key3":s3,"key4":s4}  # creating dataframe with multiple series

In [125]:
pd.DataFrame(df) # printing dataframe

   key1  key2  key3  key4
0     1     6     1     7
1     2     7     6     9
2     3     8     9     3
3     4     9     2     4
4     5    10     5     2